---
kind: type
id: T:Autodesk.Revit.DB.Events.DocumentSavingAsEventArgs
source: html/1bb9bb9f-be64-3c6f-804b-66fe6a2b0562.htm
---
# Autodesk.Revit.DB.Events.DocumentSavingAsEventArgs

The event arguments used by the DocumentSavingAs event.

## Syntax (C#)
```csharp
public class DocumentSavingAsEventArgs : RevitAPIPreDocEventArgs
```